import { Link } from 'react-router-dom';
import { useSelector } from 'react-redux';

import './header.css'

const Header = () => {
    return (
        <header>
            <div className='header container'>
                <Link className='header-logo' to='/'>
                    <svg id="Слой_1" data-name="Слой 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 2000 448"><path className="cls-1" d="M593.05,920.23v21.12q-22.64-26.87-59.59-26.92-40.88,0-69,28.86t-28.14,73.08q0,44.2,28.14,73t69,28.86q37,0,59.59-26.92v21.17h51V920.23Zm-13.93,136.27a55.67,55.67,0,0,1-38.48,14.65c-14.76,0-27.31-4.81-37.76-14.43s-15.59-23.05-15.59-40.36,5.31-30.79,15.87-40.41,23.22-14.43,38-14.43a55.37,55.37,0,0,1,38.2,14.43q16.09,14.43,16.09,40.41Q595.43,1041.82,579.12,1056.49Z" transform="translate(0 -776)"/><path className="cls-1" d="M754.07,867.33q-9.14,9.14-24,9.13t-23.79-8.89q-8.9-8.89-8.89-23.32t9.13-23.55q9.13-9.13,23.55-9.13,14.89,0,24,9.13t9.13,23.55Q763.2,858.21,754.07,867.33Z" transform="translate(0 -776)"/><rect className="cls-1" x="704.56" y="144.21" width="51.43" height="192.27"/><path className="cls-1" d="M957.4,920.21h51.43v197.56q0,50-26.92,78.11t-75,28.12q-60.09,0-91.33-41.82l37-33.17q20.19,26,54.8,26,23.55,0,36.77-15.14t13.22-42.06v-26.92q-26,27.4-64.89,27.4-34.14,0-55-22.84t-20.91-59.84V920.21h51V1024q0,20.67,10.1,33.89T906,1071.14q21.15,0,36.29-15.62t15.14-39.18Z" transform="translate(0 -776)"/><path className="cls-1" d="M1180.92,914.43q34.61,0,55.76,22.84t21.15,59.84v115.37h-51V1008.65q0-20.66-10.33-33.89t-29.08-13.22q-21.16,0-36.29,15.62T1116,1016.34v96.14h-51.43V920.21H1116v21.63Q1142,914.43,1180.92,914.43Z" transform="translate(0 -776)"/><path className="cls-1" d="M1453.94,776V941.34q-22.55-26.87-59.59-26.92-40.88,0-69,28.86t-28.14,73.08q0,44.2,28.14,73t69,28.86q37,0,59.59-26.92v21.17h51V776ZM1440,1056.49a55.67,55.67,0,0,1-38.48,14.65c-14.7,0-27.31-4.81-37.7-14.43s-15.64-23.05-15.64-40.36,5.31-30.79,15.87-40.41,23.22-14.43,38-14.43,27.47,4.81,38.2,14.43,16.14,22.94,16.14,39.91Q1456.37,1041.82,1440,1056.49Z" transform="translate(0 -776)"/><path className="cls-1" d="M1701.49,920.21h51.44v197.56q0,50-26.92,78.11T1651,1224q-60.09,0-91.33-41.82l37-33.17q20.2,26,54.8,26,23.55,0,36.77-15.14t13.22-42.06v-26.92q-26,27.4-64.89,27.4-34.14,0-55-22.84t-20.91-59.84V920.21h51V1024q0,20.67,10.1,33.89t28.36,13.22q21.14,0,36.29-15.62t15.14-39.18Z" transform="translate(0 -776)"/><path className="cls-1" d="M1949,920.23v21.12q-22.55-26.87-59.59-26.92-40.88,0-69,28.86t-28.08,73.08q0,44.2,28.08,73t69,28.86q37,0,59.59-26.92v126.92h51v-298Zm-13.71,136.49q-16.09,14.43-38.2,14.43c-14.76,0-27.36-4.81-38-14.43s-15.87-23.05-15.87-40.36,5.2-30.79,15.64-40.41,23-14.43,37.7-14.43a55.72,55.72,0,0,1,38.48,14.7c10.89,9.78,16.36,23.27,16.36,40.58C1951.46,1033.83,1946.1,1047.1,1935.32,1056.71Z" transform="translate(0 -776)"/><path className="cls-1" d="M395.7,915.14a142.8,142.8,0,0,0-29.08-45.88Q347.38,848.61,315,836.31t-73.8-12.22H138.31v209.35h.94a55.28,55.28,0,0,0,55.28-55.28V874.56h39.91q56.22,0,84.86,27.14t28.58,66.06q0,39.47-28.8,67.06T233.51,1062l-39-.5H110.67v51H241.19q41.29,0,73.8-12.27t51.63-32.95a142.8,142.8,0,0,0,29.08-45.88,147.56,147.56,0,0,0,0-106.25Z" transform="translate(0 -776)"/><path className="cls-1" d="M100.33,1061.52v51L75,1119.12A16.58,16.58,0,0,1,63.58,1118L0,1087l48,2.57a5.27,5.27,0,0,1,3.65,1.68,8.54,8.54,0,1,0-.39-11,5.16,5.16,0,0,1-3.56,1.85L0,1087l63.52-31.1a16.58,16.58,0,0,1,11.57-1.13Z" transform="translate(0 -776)"/></svg>
                </Link>

                <ul className='header-menu'>
                    <li><Link className='header-menu-item' to='/'>Басты бет</Link></li>
                    <li><Link className='header-menu-item' to='/posts'>Жаңалықтар</Link></li>
                    <li><Link className='header-menu-item' to='/materials'>Материалдар</Link></li>
                    <li><Link className='header-menu-item' to='/testing'>Тестілеу</Link></li>
                </ul>

                <Account/>
            </div>
        </header>
    );
}

const Account = () => {
    const isAuth = useSelector(state => state.user.isAuth);
    if(isAuth) {
        return (
            <div className='header-account'>
                <Link className='button' to='/profile'>Жеке кабинет</Link>
            </div>
        );
    } else {
        return(
            <div className='header-account'>
                <Link className='button second' to='/login'>Сайтқа кіру</Link>
                <Link className='button-2' to='/register'>Тіркелу</Link>
            </div>
        );
    }
}

export default Header;